%由于未能成功生成实际状况的电位和电场分布，以2000等分微元法结果代替

xym=2;%空间X、Y轴方向范围从-2到2

[X,Y]=meshgrid(linspace(-xym,xym,200),linspace(-xym,xym,200));

[V2000,E2000,E2000x,E2000y]=GENERATE(2000,1);%存储2000等分电位和电场信息

[V100,E100,E100x,E100y]=GENERATE(100,1);%存储100等分电位和电场信息

[V50,E50,E50x,E50y]=GENERATE(50,1);%存储50等分电位和电场信息

[V20,E20,E20x,E20y]=GENERATE(20,1);%存储20等分电位和电场信息

DV100=V2000-V100;%存储100等分电位与实际（2000等分）电位的差值信息

DV50=V2000-V50;%存储50等分电位与实际（2000等分）电位的差值信息

DV20=V2000-V20;%存储20等分电位与实际（2000等分）电位的差值信息

figure;

mesh(X,Y,DV100);

figure;

mesh(X,Y,DV50);

figure;

mesh(X,Y,DV20);
